{"class_name": "Model", "config": {"name": "model_2", "layers": [{"name": "input_2", "class_name": "InputLayer", "config": {"batch_input_shape": [null, 256], "dtype": "float32", "sparse": false, "name": "input_2"}, "inbound_nodes": []}, {"name": "dense_1", "class_name": "Dense", "config": {"name": "dense_1", "trainable": true, "units": 12800, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["input_2", 0, 0, {}]]]}, {"name": "reshape_1", "class_name": "Reshape", "config": {"name": "reshape_1", "trainable": true, "target_shape": [50, 256]}, "inbound_nodes": [[["dense_1", 0, 0, {}]]]}, {"name": "deconv_decoder_1_deconv1d_part1", "class_name": "Lambda", "config": {"name": "deconv_decoder_1_deconv1d_part1", "trainable": true, "function": ["4wEAAAAAAAAAAQAAAAQAAABTAAAAcw4AAAB0AGoBfABkAWQCjQJTACkDTukCAAAAKQHaBGF4aXMp\nAtoBS9oLZXhwYW5kX2RpbXMpAdoBeKkAcgYAAAD6My9ob21lL2tpc3Qtc3R1ZGVudC9EZXNrdG9w\nL21uaXN0LXdnYW4vVW50aXRsZWQtMS5wedoIPGxhbWJkYT4vAAAAcwAAAAA=\n", null, null], "function_type": "lambda", "output_shape": null, "output_shape_type": "raw", "arguments": {}}, "inbound_nodes": [[["reshape_1", 0, 0, {}]]]}, {"name": "deconv_decoder_1_deconv1d_part2", "class_name": "Conv2DTranspose", "config": {"name": "deconv_decoder_1_deconv1d_part2", "trainable": true, "filters": 256, "kernel_size": [5, 1], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "tanh", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null, "output_padding": null}, "inbound_nodes": [[["deconv_decoder_1_deconv1d_part1", 0, 0, {}]]]}, {"name": "deconv_decoder_1_deconv1d_part3", "class_name": "Lambda", "config": {"name": "deconv_decoder_1_deconv1d_part3", "trainable": true, "function": ["4wEAAAAAAAAAAQAAAAQAAABTAAAAcw4AAAB0AGoBfABkAWQCjQJTACkDTukCAAAAKQHaBGF4aXMp\nAtoBS9oHc3F1ZWV6ZSkB2gF4qQByBgAAAPozL2hvbWUva2lzdC1zdHVkZW50L0Rlc2t0b3AvbW5p\nc3Qtd2dhbi9VbnRpdGxlZC0xLnB52gg8bGFtYmRhPjMAAABzAAAAAA==\n", null, null], "function_type": "lambda", "output_shape": null, "output_shape_type": "raw", "arguments": {}}, "inbound_nodes": [[["deconv_decoder_1_deconv1d_part2", 0, 0, {}]]]}, {"name": "batch_normalization_6", "class_name": "BatchNormalization", "config": {"name": "batch_normalization_6", "trainable": true, "axis": -1, "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["deconv_decoder_1_deconv1d_part3", 0, 0, {}]]]}, {"name": "activation_1", "class_name": "Activation", "config": {"name": "activation_1", "trainable": true, "activation": "relu"}, "inbound_nodes": [[["batch_normalization_6", 0, 0, {}]]]}, {"name": "deconv_decoder_2_deconv1d_part1", "class_name": "Lambda", "config": {"name": "deconv_decoder_2_deconv1d_part1", "trainable": true, "function": ["4wEAAAAAAAAAAQAAAAQAAABTAAAAcw4AAAB0AGoBfABkAWQCjQJTACkDTukCAAAAKQHaBGF4aXMp\nAtoBS9oLZXhwYW5kX2RpbXMpAdoBeKkAcgYAAAD6My9ob21lL2tpc3Qtc3R1ZGVudC9EZXNrdG9w\nL21uaXN0LXdnYW4vVW50aXRsZWQtMS5wedoIPGxhbWJkYT4vAAAAcwAAAAA=\n", null, null], "function_type": "lambda", "output_shape": null, "output_shape_type": "raw", "arguments": {}}, "inbound_nodes": [[["activation_1", 0, 0, {}]]]}, {"name": "deconv_decoder_2_deconv1d_part2", "class_name": "Conv2DTranspose", "config": {"name": "deconv_decoder_2_deconv1d_part2", "trainable": true, "filters": 128, "kernel_size": [5, 1], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "tanh", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null, "output_padding": null}, "inbound_nodes": [[["deconv_decoder_2_deconv1d_part1", 0, 0, {}]]]}, {"name": "deconv_decoder_2_deconv1d_part3", "class_name": "Lambda", "config": {"name": "deconv_decoder_2_deconv1d_part3", "trainable": true, "function": ["4wEAAAAAAAAAAQAAAAQAAABTAAAAcw4AAAB0AGoBfABkAWQCjQJTACkDTukCAAAAKQHaBGF4aXMp\nAtoBS9oHc3F1ZWV6ZSkB2gF4qQByBgAAAPozL2hvbWUva2lzdC1zdHVkZW50L0Rlc2t0b3AvbW5p\nc3Qtd2dhbi9VbnRpdGxlZC0xLnB52gg8bGFtYmRhPjMAAABzAAAAAA==\n", null, null], "function_type": "lambda", "output_shape": null, "output_shape_type": "raw", "arguments": {}}, "inbound_nodes": [[["deconv_decoder_2_deconv1d_part2", 0, 0, {}]]]}, {"name": "batch_normalization_7", "class_name": "BatchNormalization", "config": {"name": "batch_normalization_7", "trainable": true, "axis": -1, "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["deconv_decoder_2_deconv1d_part3", 0, 0, {}]]]}, {"name": "activation_2", "class_name": "Activation", "config": {"name": "activation_2", "trainable": true, "activation": "relu"}, "inbound_nodes": [[["batch_normalization_7", 0, 0, {}]]]}, {"name": "deconv_decoder_3_deconv1d_part1", "class_name": "Lambda", "config": {"name": "deconv_decoder_3_deconv1d_part1", "trainable": true, "function": ["4wEAAAAAAAAAAQAAAAQAAABTAAAAcw4AAAB0AGoBfABkAWQCjQJTACkDTukCAAAAKQHaBGF4aXMp\nAtoBS9oLZXhwYW5kX2RpbXMpAdoBeKkAcgYAAAD6My9ob21lL2tpc3Qtc3R1ZGVudC9EZXNrdG9w\nL21uaXN0LXdnYW4vVW50aXRsZWQtMS5wedoIPGxhbWJkYT4vAAAAcwAAAAA=\n", null, null], "function_type": "lambda", "output_shape": null, "output_shape_type": "raw", "arguments": {}}, "inbound_nodes": [[["activation_2", 0, 0, {}]]]}, {"name": "deconv_decoder_3_deconv1d_part2", "class_name": "Conv2DTranspose", "config": {"name": "deconv_decoder_3_deconv1d_part2", "trainable": true, "filters": 64, "kernel_size": [5, 1], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "tanh", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null, "output_padding": null}, "inbound_nodes": [[["deconv_decoder_3_deconv1d_part1", 0, 0, {}]]]}, {"name": "deconv_decoder_3_deconv1d_part3", "class_name": "Lambda", "config": {"name": "deconv_decoder_3_deconv1d_part3", "trainable": true, "function": ["4wEAAAAAAAAAAQAAAAQAAABTAAAAcw4AAAB0AGoBfABkAWQCjQJTACkDTukCAAAAKQHaBGF4aXMp\nAtoBS9oHc3F1ZWV6ZSkB2gF4qQByBgAAAPozL2hvbWUva2lzdC1zdHVkZW50L0Rlc2t0b3AvbW5p\nc3Qtd2dhbi9VbnRpdGxlZC0xLnB52gg8bGFtYmRhPjMAAABzAAAAAA==\n", null, null], "function_type": "lambda", "output_shape": null, "output_shape_type": "raw", "arguments": {}}, "inbound_nodes": [[["deconv_decoder_3_deconv1d_part2", 0, 0, {}]]]}, {"name": "batch_normalization_8", "class_name": "BatchNormalization", "config": {"name": "batch_normalization_8", "trainable": true, "axis": -1, "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["deconv_decoder_3_deconv1d_part3", 0, 0, {}]]]}, {"name": "activation_3", "class_name": "Activation", "config": {"name": "activation_3", "trainable": true, "activation": "relu"}, "inbound_nodes": [[["batch_normalization_8", 0, 0, {}]]]}, {"name": "deconv_decoder_4_deconv1d_part1", "class_name": "Lambda", "config": {"name": "deconv_decoder_4_deconv1d_part1", "trainable": true, "function": ["4wEAAAAAAAAAAQAAAAQAAABTAAAAcw4AAAB0AGoBfABkAWQCjQJTACkDTukCAAAAKQHaBGF4aXMp\nAtoBS9oLZXhwYW5kX2RpbXMpAdoBeKkAcgYAAAD6My9ob21lL2tpc3Qtc3R1ZGVudC9EZXNrdG9w\nL21uaXN0LXdnYW4vVW50aXRsZWQtMS5wedoIPGxhbWJkYT4vAAAAcwAAAAA=\n", null, null], "function_type": "lambda", "output_shape": null, "output_shape_type": "raw", "arguments": {}}, "inbound_nodes": [[["activation_3", 0, 0, {}]]]}, {"name": "deconv_decoder_4_deconv1d_part2", "class_name": "Conv2DTranspose", "config": {"name": "deconv_decoder_4_deconv1d_part2", "trainable": true, "filters": 32, "kernel_size": [5, 1], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "tanh", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null, "output_padding": null}, "inbound_nodes": [[["deconv_decoder_4_deconv1d_part1", 0, 0, {}]]]}, {"name": "deconv_decoder_4_deconv1d_part3", "class_name": "Lambda", "config": {"name": "deconv_decoder_4_deconv1d_part3", "trainable": true, "function": ["4wEAAAAAAAAAAQAAAAQAAABTAAAAcw4AAAB0AGoBfABkAWQCjQJTACkDTukCAAAAKQHaBGF4aXMp\nAtoBS9oHc3F1ZWV6ZSkB2gF4qQByBgAAAPozL2hvbWUva2lzdC1zdHVkZW50L0Rlc2t0b3AvbW5p\nc3Qtd2dhbi9VbnRpdGxlZC0xLnB52gg8bGFtYmRhPjMAAABzAAAAAA==\n", null, null], "function_type": "lambda", "output_shape": null, "output_shape_type": "raw", "arguments": {}}, "inbound_nodes": [[["deconv_decoder_4_deconv1d_part2", 0, 0, {}]]]}, {"name": "batch_normalization_9", "class_name": "BatchNormalization", "config": {"name": "batch_normalization_9", "trainable": true, "axis": -1, "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["deconv_decoder_4_deconv1d_part3", 0, 0, {}]]]}, {"name": "activation_4", "class_name": "Activation", "config": {"name": "activation_4", "trainable": true, "activation": "relu"}, "inbound_nodes": [[["batch_normalization_9", 0, 0, {}]]]}, {"name": "deconv_decoder_5_deconv1d_part1", "class_name": "Lambda", "config": {"name": "deconv_decoder_5_deconv1d_part1", "trainable": true, "function": ["4wEAAAAAAAAAAQAAAAQAAABTAAAAcw4AAAB0AGoBfABkAWQCjQJTACkDTukCAAAAKQHaBGF4aXMp\nAtoBS9oLZXhwYW5kX2RpbXMpAdoBeKkAcgYAAAD6My9ob21lL2tpc3Qtc3R1ZGVudC9EZXNrdG9w\nL21uaXN0LXdnYW4vVW50aXRsZWQtMS5wedoIPGxhbWJkYT4vAAAAcwAAAAA=\n", null, null], "function_type": "lambda", "output_shape": null, "output_shape_type": "raw", "arguments": {}}, "inbound_nodes": [[["activation_4", 0, 0, {}]]]}, {"name": "deconv_decoder_5_deconv1d_part2", "class_name": "Conv2DTranspose", "config": {"name": "deconv_decoder_5_deconv1d_part2", "trainable": true, "filters": 2, "kernel_size": [5, 1], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "tanh", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null, "output_padding": null}, "inbound_nodes": [[["deconv_decoder_5_deconv1d_part1", 0, 0, {}]]]}, {"name": "deconv_decoder_5_deconv1d_part3", "class_name": "Lambda", "config": {"name": "deconv_decoder_5_deconv1d_part3", "trainable": true, "function": ["4wEAAAAAAAAAAQAAAAQAAABTAAAAcw4AAAB0AGoBfABkAWQCjQJTACkDTukCAAAAKQHaBGF4aXMp\nAtoBS9oHc3F1ZWV6ZSkB2gF4qQByBgAAAPozL2hvbWUva2lzdC1zdHVkZW50L0Rlc2t0b3AvbW5p\nc3Qtd2dhbi9VbnRpdGxlZC0xLnB52gg8bGFtYmRhPjMAAABzAAAAAA==\n", null, null], "function_type": "lambda", "output_shape": null, "output_shape_type": "raw", "arguments": {}}, "inbound_nodes": [[["deconv_decoder_5_deconv1d_part2", 0, 0, {}]]]}, {"name": "activation_5", "class_name": "Activation", "config": {"name": "activation_5", "trainable": true, "activation": "tanh"}, "inbound_nodes": [[["deconv_decoder_5_deconv1d_part3", 0, 0, {}]]]}], "input_layers": [["input_2", 0, 0]], "output_layers": [["activation_5", 0, 0]]}, "keras_version": "2.2.4", "backend": "tensorflow"}